e = int(input('請輸入本月電費:'))
if e<=120:
    fee = e*2.1
    print('夏月電費%.2f '%(fee))
elif e<=330:
    fee = 120*2.1+(e-120)*3.02
    print('夏月電費%.2f '%(fee))
elif e<=500:
    fee = 120*2.1+210*3.02+(e-330)*4.39
    print('夏月電費%.2f '%(fee))
elif e<=700:
    fee = 120*2.1+210*3.02+170*4.39+(e-500)*4.97
    print('夏月電費%.2f '%(fee))
elif e>700:
    fee = 120*2.1+210*3.02+170*4.39+200*4.97+(e-700)*5.63
    print('夏月電費%.2f '%(fee))

if e<=120:
    fee = e*2.1
    print('非夏月電費%.2f '%(fee))
elif e<=330:
    fee = 120*2.1+(e-120)*2.68
    print('非夏月電費%.2f '%(fee))
elif e<=500:
    fee = 120*2.1+210*2.68+(e-330)*3.61
    print('非夏月電費%.2f '%(fee))
elif e<=700:
    fee = 120*2.1+210*2.68+170*3.61+(e-500)*4.01
    print('非夏月電費%.2f '%(fee))
elif e>700:
    fee = 120*2.1+210*2.68+170*3.61+200*4.01+(e-700)*4.50
    print('非夏月電費%.2f '%(fee))


